zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT735SGAWAR-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from MIMXRT735SGAWAR/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT735SGAWAR_
#define _ZEPHYR_DTS_BINDING_MIMXRT735SGAWAR_

#define IOPCTL_MUX(index, offset, mux)		\
	((((index) & 0x7) << 15) |		\
	(((offset) & 0xFFF) << 20) |		\
	(((mux) & 0xF) << 0))

#define PMIC_I2C_SCL IOPCTL_MUX(1, 96, 0) /* PIO0_0 */
#define PMIC_I2C_SDA IOPCTL_MUX(1, 97, 0) /* PIO0_0 */
#define CTIMER0_CAPTURE0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER0_CAPTURE1_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER0_CAPTURE2_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER0_CAPTURE3_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER1_CAPTURE0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER1_CAPTURE1_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER1_CAPTURE2_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER1_CAPTURE3_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER2_CAPTURE0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER2_CAPTURE1_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER2_CAPTURE2_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER2_CAPTURE3_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER3_CAPTURE0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER3_CAPTURE1_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER3_CAPTURE2_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER3_CAPTURE3_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER4_CAPTURE0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER4_CAPTURE1_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER4_CAPTURE2_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER4_CAPTURE3_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define CTIMER_C_INP9_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define GPIO0_GPIO0_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define LP_FLEXCOMM8_P2_PIO0_0 IOPCTL_MUX(0, 0, 1) /* PIO0_0 */
#define PINT0_PINT0_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT1_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT2_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT3_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT4_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT5_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT6_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT0_PINT7_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define SAI0_RX_BCLK_PIO0_0 IOPCTL_MUX(0, 0, 5) /* PIO0_0 */
#define SAI1_TX_BCLK_PIO0_0 IOPCTL_MUX(0, 0, 6) /* PIO0_0 */
#define SCT0_IN0_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN1_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN2_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN3_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN4_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN5_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_IN6_PIO0_0 IOPCTL_MUX(0, 0, 2) /* PIO0_0 */
#define SCT0_OUT0_PIO0_0 IOPCTL_MUX(0, 0, 3) /* PIO0_0 */
#define CTIMER0_MATCH0_PIO0_1 IOPCTL_MUX(0, 1, 4) /* PIO0_1 */
#define GPIO0_GPIO1_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define LP_FLEXCOMM8_P3_PIO0_1 IOPCTL_MUX(0, 1, 1) /* PIO0_1 */
#define PINT0_PINT0_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT1_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT2_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT3_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT4_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT5_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT6_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT0_PINT7_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define SAI0_RX_SYNC_PIO0_1 IOPCTL_MUX(0, 1, 5) /* PIO0_1 */
#define SAI1_RX_DATA0_PIO0_1 IOPCTL_MUX(0, 1, 6) /* PIO0_1 */
#define SCT0_IN0_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN1_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN2_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN3_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN4_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN5_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_IN6_PIO0_1 IOPCTL_MUX(0, 1, 2) /* PIO0_1 */
#define SCT0_OUT1_PIO0_1 IOPCTL_MUX(0, 1, 3) /* PIO0_1 */
#define CTIMER0_MATCH1_PIO0_2 IOPCTL_MUX(0, 2, 4) /* PIO0_2 */
#define GPIO0_GPIO2_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define LP_FLEXCOMM8_P4_PIO0_2 IOPCTL_MUX(0, 2, 1) /* PIO0_2 */
#define LP_FLEXCOMM9_P0_PIO0_2 IOPCTL_MUX(0, 2, 7) /* PIO0_2 */
#define PINT0_PINT0_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT1_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT2_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT3_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT4_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT5_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT6_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT0_PINT7_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define SAI0_RX_DATA0_PIO0_2 IOPCTL_MUX(0, 2, 5) /* PIO0_2 */
#define SCT0_IN0_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN1_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN2_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN3_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN4_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN5_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_IN6_PIO0_2 IOPCTL_MUX(0, 2, 2) /* PIO0_2 */
#define SCT0_OUT2_PIO0_2 IOPCTL_MUX(0, 2, 3) /* PIO0_2 */
#define CTIMER0_MATCH2_PIO0_3 IOPCTL_MUX(0, 3, 4) /* PIO0_3 */
#define GPIO0_GPIO3_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define LP_FLEXCOMM4_P0_PIO0_3 IOPCTL_MUX(0, 3, 1) /* PIO0_3 */
#define PINT0_PINT0_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT1_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT2_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT3_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT4_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT5_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT6_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT0_PINT7_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define SAI0_TX_BCLK_PIO0_3 IOPCTL_MUX(0, 3, 5) /* PIO0_3 */
#define SCT0_IN0_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN1_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN2_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN3_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN4_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN5_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_IN6_PIO0_3 IOPCTL_MUX(0, 3, 2) /* PIO0_3 */
#define SCT0_OUT3_PIO0_3 IOPCTL_MUX(0, 3, 3) /* PIO0_3 */
#define CTIMER0_MATCH3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define GPIO0_GPIO4_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define LP_FLEXCOMM4_P1_PIO0_4 IOPCTL_MUX(0, 4, 1) /* PIO0_4 */
#define PINT0_PINT0_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT1_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT2_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT3_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT4_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT5_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT6_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT0_PINT7_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define SAI0_TX_DATA0_PIO0_4 IOPCTL_MUX(0, 4, 5) /* PIO0_4 */
#define SCT0_IN0_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN1_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN2_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN3_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN4_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN5_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_IN6_PIO0_4 IOPCTL_MUX(0, 4, 2) /* PIO0_4 */
#define SCT0_OUT4_PIO0_4 IOPCTL_MUX(0, 4, 3) /* PIO0_4 */
#define CLKCTL0_MCLK_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define CTIMER2_MATCH0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define GPIO0_GPIO5_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define LP_FLEXCOMM4_P4_PIO0_5 IOPCTL_MUX(0, 5, 1) /* PIO0_5 */
#define LP_FLEXCOMM9_P1_PIO0_5 IOPCTL_MUX(0, 5, 7) /* PIO0_5 */
#define PINT0_PINT0_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT1_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT2_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT3_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT4_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT5_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT6_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT0_PINT7_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define SAI0_TX_SYNC_PIO0_5 IOPCTL_MUX(0, 5, 5) /* PIO0_5 */
#define SCT0_IN0_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN1_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN2_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN3_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN4_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN5_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_IN6_PIO0_5 IOPCTL_MUX(0, 5, 6) /* PIO0_5 */
#define SCT0_OUT5_PIO0_5 IOPCTL_MUX(0, 5, 3) /* PIO0_5 */
#define CTIMER0_CAPTURE0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER0_CAPTURE1_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER0_CAPTURE2_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER0_CAPTURE3_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER1_CAPTURE0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER1_CAPTURE1_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER1_CAPTURE2_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER1_CAPTURE3_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER2_CAPTURE0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER2_CAPTURE1_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER2_CAPTURE2_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER2_CAPTURE3_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER3_CAPTURE0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER3_CAPTURE1_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER3_CAPTURE2_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER3_CAPTURE3_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER4_CAPTURE0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER4_CAPTURE1_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER4_CAPTURE2_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER4_CAPTURE3_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define CTIMER_C_INP10_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define GPIO0_GPIO6_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define LP_FLEXCOMM4_P2_PIO0_6 IOPCTL_MUX(0, 6, 1) /* PIO0_6 */
#define LP_FLEXCOMM8_P0_PIO0_6 IOPCTL_MUX(0, 6, 5) /* PIO0_6 */
#define PINT0_PINT0_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT1_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT2_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT3_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT4_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT5_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT6_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT0_PINT7_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define SCT0_IN0_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN1_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN2_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN3_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN4_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN5_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN6_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_OUT6_PIO0_6 IOPCTL_MUX(0, 6, 3) /* PIO0_6 */
#define CTIMER0_CAPTURE0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER0_CAPTURE1_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER0_CAPTURE2_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER0_CAPTURE3_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER1_CAPTURE0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER1_CAPTURE1_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER1_CAPTURE2_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER1_CAPTURE3_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER2_CAPTURE0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER2_CAPTURE1_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER2_CAPTURE2_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER2_CAPTURE3_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER3_CAPTURE0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER3_CAPTURE1_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER3_CAPTURE2_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER3_CAPTURE3_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER4_CAPTURE0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER4_CAPTURE1_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER4_CAPTURE2_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER4_CAPTURE3_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define CTIMER_C_INP11_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define GPIO0_GPIO7_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define LP_FLEXCOMM4_P3_PIO0_7 IOPCTL_MUX(0, 7, 1) /* PIO0_7 */
#define LP_FLEXCOMM8_P1_PIO0_7 IOPCTL_MUX(0, 7, 5) /* PIO0_7 */
#define PINT0_PINT0_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT1_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT2_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT3_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT4_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT5_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT6_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT0_PINT7_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define SCT0_IN0_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN1_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN2_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN3_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN4_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN5_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN6_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_OUT7_PIO0_7 IOPCTL_MUX(0, 7, 3) /* PIO0_7 */
#define CTIMER0_CAPTURE0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER0_CAPTURE1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER0_CAPTURE2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER0_CAPTURE3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER1_CAPTURE0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER1_CAPTURE1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER1_CAPTURE2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER1_CAPTURE3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER1_MATCH0_PIO0_10 IOPCTL_MUX(0, 10, 4) /* PIO0_10 */
#define CTIMER2_CAPTURE0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER2_CAPTURE1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER2_CAPTURE2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER2_CAPTURE3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER3_CAPTURE0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER3_CAPTURE1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER3_CAPTURE2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER3_CAPTURE3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER4_CAPTURE0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER4_CAPTURE1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER4_CAPTURE2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER4_CAPTURE3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define CTIMER_C_INP0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define FLEXIO_TRIG0_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define FLEXIO_TRIG1_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define FLEXIO_TRIG2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define FLEXIO_TRIG3_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define GPIO0_GPIO10_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define LP_FLEXCOMM5_P0_PIO0_10 IOPCTL_MUX(0, 10, 1) /* PIO0_10 */
#define PINT0_PINT0_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT1_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT2_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT3_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT4_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT5_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT6_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT0_PINT7_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define SAI2_RX_DATA0_PIO0_10 IOPCTL_MUX(0, 10, 6) /* PIO0_10 */
#define SCT0_IN0_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN1_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN2_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN3_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN4_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN5_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN6_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_OUT4_PIO0_10 IOPCTL_MUX(0, 10, 3) /* PIO0_10 */
#define CTIMER1_MATCH1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define GPIO0_GPIO11_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define LP_FLEXCOMM5_P1_PIO0_11 IOPCTL_MUX(0, 11, 1) /* PIO0_11 */
#define PINT0_PINT0_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT1_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT2_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT3_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT4_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT5_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT6_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT0_PINT7_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define SAI2_TX_BCLK_PIO0_11 IOPCTL_MUX(0, 11, 5) /* PIO0_11 */
#define SCT0_IN0_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN1_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN2_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN3_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN4_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN5_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN6_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_OUT5_PIO0_11 IOPCTL_MUX(0, 11, 3) /* PIO0_11 */
#define CTIMER1_MATCH2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define GPIO0_GPIO12_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define LP_FLEXCOMM5_P2_PIO0_12 IOPCTL_MUX(0, 12, 1) /* PIO0_12 */
#define PINT0_PINT0_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT1_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT2_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT3_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT4_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT5_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT6_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT0_PINT7_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define SAI2_TX_DATA0_PIO0_12 IOPCTL_MUX(0, 12, 5) /* PIO0_12 */
#define SCT0_IN0_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN1_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN2_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN3_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN4_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN5_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN6_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_OUT6_PIO0_12 IOPCTL_MUX(0, 12, 3) /* PIO0_12 */
#define CTIMER1_MATCH3_PIO0_13 IOPCTL_MUX(0, 13, 4) /* PIO0_13 */
#define GPIO0_GPIO13_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define LP_FLEXCOMM5_P3_PIO0_13 IOPCTL_MUX(0, 13, 1) /* PIO0_13 */
#define PINT0_PINT0_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT1_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT2_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT3_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT4_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT5_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT6_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT0_PINT7_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define SAI2_TX_SYNC_PIO0_13 IOPCTL_MUX(0, 13, 5) /* PIO0_13 */
#define SCT0_IN0_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN1_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN2_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN3_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN4_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN5_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN6_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_OUT7_PIO0_13 IOPCTL_MUX(0, 13, 3) /* PIO0_13 */
#define CLKCTL0_CLKOUT_VDD2_PIO0_14 IOPCTL_MUX(0, 14, 6) /* PIO0_14 */
#define CTIMER0_CAPTURE0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER0_CAPTURE1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER0_CAPTURE2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER0_CAPTURE3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER1_CAPTURE0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER1_CAPTURE1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER1_CAPTURE2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER1_CAPTURE3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER2_CAPTURE0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER2_CAPTURE1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER2_CAPTURE2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER2_CAPTURE3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER3_CAPTURE0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER3_CAPTURE1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER3_CAPTURE2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER3_CAPTURE3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER4_CAPTURE0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER4_CAPTURE1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER4_CAPTURE2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER4_CAPTURE3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define CTIMER_C_INP2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define FLEXIO_TRIG0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define FLEXIO_TRIG1_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define FLEXIO_TRIG2_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define FLEXIO_TRIG3_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define GPIO0_GPIO14_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define LP_FLEXCOMM5_P4_PIO0_14 IOPCTL_MUX(0, 14, 1) /* PIO0_14 */
#define PINT0_PINT0_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT1_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT2_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT3_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT4_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT5_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT6_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT7_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define SAI2_RX_DATA0_PIO0_14 IOPCTL_MUX(0, 14, 5) /* PIO0_14 */
#define SCT0_IN0_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN1_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN2_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN3_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN4_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN5_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN6_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_OUT8_PIO0_14 IOPCTL_MUX(0, 14, 3) /* PIO0_14 */
#define CTIMER2_MATCH2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define GPIO0_GPIO19_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define LP_FLEXCOMM6_P2_PIO0_19 IOPCTL_MUX(0, 19, 1) /* PIO0_19 */
