zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT735SGAWAR-pinctrl.h
#define LP_FLEXCOMM19_P2_PIO8_25 IOPCTL_MUX(1, 25, 3) /* PIO8_25 */
#define PINT1_PINT0_PIO8_25 IOPCTL_MUX(1, 25, 0) /* PIO8_25 */
#define PINT1_PINT1_PIO8_25 IOPCTL_MUX(1, 25, 0) /* PIO8_25 */
#define PINT1_PINT2_PIO8_25 IOPCTL_MUX(1, 25, 0) /* PIO8_25 */
#define PINT1_PINT3_PIO8_25 IOPCTL_MUX(1, 25, 0) /* PIO8_25 */
#define SAI3_RX_SYNC_PIO8_25 IOPCTL_MUX(1, 25, 1) /* PIO8_25 */
#define CTIMER6_MATCH1_PIO8_26 IOPCTL_MUX(1, 26, 2) /* PIO8_26 */
#define GPIO8_GPIO26_PIO8_26 IOPCTL_MUX(1, 26, 0) /* PIO8_26 */
#define LP_FLEXCOMM19_P3_PIO8_26 IOPCTL_MUX(1, 26, 3) /* PIO8_26 */
#define PINT1_PINT0_PIO8_26 IOPCTL_MUX(1, 26, 0) /* PIO8_26 */
#define PINT1_PINT1_PIO8_26 IOPCTL_MUX(1, 26, 0) /* PIO8_26 */
#define PINT1_PINT2_PIO8_26 IOPCTL_MUX(1, 26, 0) /* PIO8_26 */
#define PINT1_PINT3_PIO8_26 IOPCTL_MUX(1, 26, 0) /* PIO8_26 */
#define SAI3_TX_BCLK_PIO8_26 IOPCTL_MUX(1, 26, 1) /* PIO8_26 */
#define CTIMER5_CAPTURE0_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER5_CAPTURE1_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER5_CAPTURE2_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER5_CAPTURE3_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER6_CAPTURE0_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER6_CAPTURE1_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER6_CAPTURE2_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER6_CAPTURE3_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER7_CAPTURE0_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER7_CAPTURE1_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER7_CAPTURE2_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER7_CAPTURE3_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define CTIMER_S_INP9_PIO8_30 IOPCTL_MUX(1, 30, 2) /* PIO8_30 */
#define GPIO8_GPIO30_PIO8_30 IOPCTL_MUX(1, 30, 0) /* PIO8_30 */
#define LP_FLEXCOMM20_P0_PIO8_30 IOPCTL_MUX(1, 30, 1) /* PIO8_30 */
#define PINT1_PINT0_PIO8_30 IOPCTL_MUX(1, 30, 0) /* PIO8_30 */
#define PINT1_PINT1_PIO8_30 IOPCTL_MUX(1, 30, 0) /* PIO8_30 */
#define PINT1_PINT2_PIO8_30 IOPCTL_MUX(1, 30, 0) /* PIO8_30 */
#define PINT1_PINT3_PIO8_30 IOPCTL_MUX(1, 30, 0) /* PIO8_30 */
#define UTICK1_CAPTURE3_PIO8_30 IOPCTL_MUX(1, 30, 3) /* PIO8_30 */
#define CTIMER7_MATCH0_PIO8_31 IOPCTL_MUX(1, 31, 2) /* PIO8_31 */
#define GPIO8_GPIO31_PIO8_31 IOPCTL_MUX(1, 31, 0) /* PIO8_31 */
#define LP_FLEXCOMM20_P1_PIO8_31 IOPCTL_MUX(1, 31, 1) /* PIO8_31 */
#define PINT1_PINT0_PIO8_31 IOPCTL_MUX(1, 31, 0) /* PIO8_31 */
#define PINT1_PINT1_PIO8_31 IOPCTL_MUX(1, 31, 0) /* PIO8_31 */
#define PINT1_PINT2_PIO8_31 IOPCTL_MUX(1, 31, 0) /* PIO8_31 */
#define PINT1_PINT3_PIO8_31 IOPCTL_MUX(1, 31, 0) /* PIO8_31 */
#define ADC0_CH0_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define GPIO10_GPIO0_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PDM_CLK_PIO10_0 IOPCTL_MUX(1, 64, 5) /* PIO10_0 */
#define PINT1_PINT0_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT1_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT2_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT3_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define ADC0_CH18_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define GPIO10_GPIO1_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PDM_DATA0_1_PIO10_1 IOPCTL_MUX(1, 65, 5) /* PIO10_1 */
#define PINT1_PINT0_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT1_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT2_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT3_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define ADC0_CH1_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define GPIO10_GPIO2_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PDM_DATA2_3_PIO10_2 IOPCTL_MUX(1, 66, 5) /* PIO10_2 */
#define PINT1_PINT0_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT1_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT2_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT3_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define ADC0_CH19_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define GPIO10_GPIO3_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PDM_DATA4_5_PIO10_3 IOPCTL_MUX(1, 67, 5) /* PIO10_3 */
#define PINT1_PINT0_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT1_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT2_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT3_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define ADC0_CH2_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define GPIO10_GPIO4_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PDM_DATA6_7_PIO10_4 IOPCTL_MUX(1, 68, 5) /* PIO10_4 */
#define PINT1_PINT0_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT1_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT2_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT3_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define ADC0_CH20_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define CMP0_OUT_PIO10_5 IOPCTL_MUX(1, 69, 3) /* PIO10_5 */
#define GPIO10_GPIO5_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT0_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT1_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT2_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT3_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define GPIO10_GPIO6_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT0_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT1_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT2_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT3_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define SDADC_INP0_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define GPIO10_GPIO7_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT0_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT1_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT2_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT3_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define SDADC_INN0_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define ACMP0_IN1_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define GPIO10_GPIO8_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PDM_CLK_PIO10_8 IOPCTL_MUX(1, 72, 5) /* PIO10_8 */
#define PINT1_PINT0_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT1_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT2_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT3_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define ACMP0_IN2_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define GPIO10_GPIO9_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PDM_DATA0_1_PIO10_9 IOPCTL_MUX(1, 73, 5) /* PIO10_9 */
#define PINT1_PINT0_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT1_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT2_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT3_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define ADC0_CH4_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define GPIO10_GPIO12_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PDM_DATA2_3_PIO10_12 IOPCTL_MUX(1, 76, 5) /* PIO10_12 */
#define PINT1_PINT0_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT1_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT2_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT3_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define SDADC_INP1_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define ADC0_CH22_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define GPIO10_GPIO13_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PDM_CLK_PIO10_13 IOPCTL_MUX(1, 77, 5) /* PIO10_13 */
#define PINT1_PINT0_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT1_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT2_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT3_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define SDADC_INN1_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */

#endif
